[Killed] BlockStatement
Lab/Lab Final/src/1-loan.js:1:62
-function calculateLoan(LoanAmount, interestRate, MonthToPay) {
-  if (LoanAmount === '' || LoanAmount < 0 || isNaN(LoanAmount)) {
-    return 'Please provide a valid loan amount';
-  } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
-    return 'Please provide a valid interestRate';
-  } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
-    return 'Please provide a valid month';
-  } else {
-    const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-    let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
-    return payment;
-  }
-}
+function calculateLoan(LoanAmount, interestRate, MonthToPay) {}
 // console.log(calculateLoan(100, 200, ''));
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "83.42"
Received: undefined

[Killed] ConditionalExpression
Lab/Lab Final/src/1-loan.js:2:7
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
-  if (LoanAmount === '' || LoanAmount < 0 || isNaN(LoanAmount)) {
+  if (false || isNaN(LoanAmount)) {
     return 'Please provide a valid loan amount';
   } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid loan amount"
Received: "-8.34"

[Killed] ConditionalExpression
Lab/Lab Final/src/1-loan.js:2:7
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
-  if (LoanAmount === '' || LoanAmount < 0 || isNaN(LoanAmount)) {
+  if (false) {
     return 'Please provide a valid loan amount';
   } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid loan amount"
Received: "-8.34"

[Killed] EqualityOperator
Lab/Lab Final/src/1-loan.js:4:14
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
   if (LoanAmount === '' || LoanAmount < 0 || isNaN(LoanAmount)) {
     return 'Please provide a valid loan amount';
-  } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
+  } else if (interestRate !== '' || interestRate < 0 || isNaN(interestRate)) {
     return 'Please provide a valid interestRate';
   } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "83.42"
Received: "Please provide a valid interestRate"

[Killed] ConditionalExpression
Lab/Lab Final/src/1-loan.js:4:14
 function calculateLoan(LoanAmount, interestRate, MonthToPay) {
   if (LoanAmount === '' || LoanAmount < 0 || isNaN(LoanAmount)) {
     return 'Please provide a valid loan amount';
-  } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
+  } else if (false) {
     return 'Please provide a valid interestRate';
   } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid interestRate"
Received: "8.33"

[Killed] StringLiteral
Lab/Lab Final/src/1-loan.js:5:12
   if (LoanAmount === '' || LoanAmount < 0 || isNaN(LoanAmount)) {
     return 'Please provide a valid loan amount';
   } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
-    return 'Please provide a valid interestRate';
+    return "";
   } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
     return 'Please provide a valid month';
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid interestRate"
Received: ""

[Killed] ConditionalExpression
Lab/Lab Final/src/1-loan.js:6:35
     return 'Please provide a valid loan amount';
   } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
     return 'Please provide a valid interestRate';
-  } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
+  } else if (MonthToPay === '' || false || isNaN(MonthToPay)) {
     return 'Please provide a valid month';
   } else {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid month"
Received: "-0.00"

[Killed] EqualityOperator
Lab/Lab Final/src/1-loan.js:6:14
     return 'Please provide a valid loan amount';
   } else if (interestRate === '' || interestRate < 0 || isNaN(interestRate)) {
     return 'Please provide a valid interestRate';
-  } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
+  } else if (MonthToPay !== '' || MonthToPay < 0 || isNaN(MonthToPay)) {
     return 'Please provide a valid month';
   } else {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "83.42"
Received: "Please provide a valid month"

[Killed] BlockStatement
Lab/Lab Final/src/1-loan.js:8:10
     return 'Please provide a valid interestRate';
   } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
     return 'Please provide a valid month';
-  } else {
-    const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-    let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
-    return payment;
-  }
+  } else {}
 }
 // console.log(calculateLoan(100, 200, ''));
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "83.42"
Received: undefined

[Killed] ArithmeticOperator
Lab/Lab Final/src/1-loan.js:9:22
   } else if (MonthToPay === '' || MonthToPay < 0 || isNaN(MonthToPay)) {
     return 'Please provide a valid month';
   } else {
-    const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
+    const interest = LoanAmount * (interestRate * 0.01) * MonthToPay;
     let payment = (LoanAmount / MonthToPay + interest).toFixed(2);
     return payment;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "83.42"
Received: "95.33"
