[Killed] BlockStatement
Lab/Lab Final/src/2-converter.js:1:44
-function LengthConverter(measurement, val) {
-  var result1, result2;
-
-  if (measurement == 'feets') {
-    result1 = (val * 12).toFixed(2) + ' inches';
-    result2 = (val / 5280).toFixed(2) + ' miles';
-  } else if (measurement === 'inches') {
-    result1 = (val / 12).toFixed(2) + ' feets';
-    result2 = (val / 63360).toFixed(2) + ' miles';
-  } else if (measurement === 'miles') {
-    result1 = (val * 5280).toFixed(2) + ' feets';
-    result2 = (val * 63360).toFixed(2) + ' inches';
-  } else {
-    return 'wrong input';
-  }
-  return [result1, result2];
-}
+function LengthConverter(measurement, val) {}
 
 // console.log(LengthConverter('', 5.0));
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["36.00 inches", "0.00 miles"]
Received: undefined

[Killed] EqualityOperator
Lab/Lab Final/src/2-converter.js:4:7
 function LengthConverter(measurement, val) {
   var result1, result2;
 
-  if (measurement == 'feets') {
+  if (measurement != 'feets') {
     result1 = (val * 12).toFixed(2) + ' inches';
     result2 = (val / 5280).toFixed(2) + ' miles';
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["36.00 inches", "0.00 miles"]
Received: "wrong input"

[Killed] ConditionalExpression
Lab/Lab Final/src/2-converter.js:4:7
 function LengthConverter(measurement, val) {
   var result1, result2;
 
-  if (measurement == 'feets') {
+  if (true) {
     result1 = (val * 12).toFixed(2) + ' inches';
     result2 = (val / 5280).toFixed(2) + ' miles';
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "0.25 feets",
+   "36.00 inches",

[Killed] ArithmeticOperator
Lab/Lab Final/src/2-converter.js:5:16
   var result1, result2;
 
   if (measurement == 'feets') {
-    result1 = (val * 12).toFixed(2) + ' inches';
+    result1 = (val / 12).toFixed(2) + ' inches';
     result2 = (val / 5280).toFixed(2) + ' miles';
   } else if (measurement === 'inches') {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "36.00 inches",
+   "0.25 inches",

[Killed] ArithmeticOperator
Lab/Lab Final/src/2-converter.js:6:16
 
   if (measurement == 'feets') {
     result1 = (val * 12).toFixed(2) + ' inches';
-    result2 = (val / 5280).toFixed(2) + ' miles';
+    result2 = (val * 5280).toFixed(2) + ' miles';
   } else if (measurement === 'inches') {
     result1 = (val / 12).toFixed(2) + ' feets';
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "36.00 inches",
-   "0.00 miles",

[Killed] StringLiteral
Lab/Lab Final/src/2-converter.js:6:41
 
   if (measurement == 'feets') {
     result1 = (val * 12).toFixed(2) + ' inches';
-    result2 = (val / 5280).toFixed(2) + ' miles';
+    result2 = (val / 5280).toFixed(2) + "";
   } else if (measurement === 'inches') {
     result1 = (val / 12).toFixed(2) + ' feets';
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "36.00 inches",
-   "0.00 miles",

[Killed] BlockStatement
Lab/Lab Final/src/2-converter.js:7:40
   if (measurement == 'feets') {
     result1 = (val * 12).toFixed(2) + ' inches';
     result2 = (val / 5280).toFixed(2) + ' miles';
-  } else if (measurement === 'inches') {
-    result1 = (val / 12).toFixed(2) + ' feets';
-    result2 = (val / 63360).toFixed(2) + ' miles';
-  } else if (measurement === 'miles') {
+  } else if (measurement === 'inches') {} else if (measurement === 'miles') {
     result1 = (val * 5280).toFixed(2) + ' feets';
     result2 = (val * 63360).toFixed(2) + ' inches';
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "0.25 feets",
-   "0.00 miles",

[Killed] EqualityOperator
Lab/Lab Final/src/2-converter.js:7:14
   if (measurement == 'feets') {
     result1 = (val * 12).toFixed(2) + ' inches';
     result2 = (val / 5280).toFixed(2) + ' miles';
-  } else if (measurement === 'inches') {
+  } else if (measurement !== 'inches') {
     result1 = (val / 12).toFixed(2) + ' feets';
     result2 = (val / 63360).toFixed(2) + ' miles';
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["0.25 feets", "0.00 miles"]
Received: "wrong input"

[Killed] ArithmeticOperator
Lab/Lab Final/src/2-converter.js:8:16
     result1 = (val * 12).toFixed(2) + ' inches';
     result2 = (val / 5280).toFixed(2) + ' miles';
   } else if (measurement === 'inches') {
-    result1 = (val / 12).toFixed(2) + ' feets';
+    result1 = (val * 12).toFixed(2) + ' feets';
     result2 = (val / 63360).toFixed(2) + ' miles';
   } else if (measurement === 'miles') {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "0.25 feets",
+   "36.00 feets",

[Killed] ArithmeticOperator
Lab/Lab Final/src/2-converter.js:9:16
     result2 = (val / 5280).toFixed(2) + ' miles';
   } else if (measurement === 'inches') {
     result1 = (val / 12).toFixed(2) + ' feets';
-    result2 = (val / 63360).toFixed(2) + ' miles';
+    result2 = (val * 63360).toFixed(2) + ' miles';
   } else if (measurement === 'miles') {
     result1 = (val * 5280).toFixed(2) + ' feets';
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "0.25 feets",
-   "0.00 miles",

[Killed] BlockStatement
Lab/Lab Final/src/2-converter.js:10:39
   } else if (measurement === 'inches') {
     result1 = (val / 12).toFixed(2) + ' feets';
     result2 = (val / 63360).toFixed(2) + ' miles';
-  } else if (measurement === 'miles') {
-    result1 = (val * 5280).toFixed(2) + ' feets';
-    result2 = (val * 63360).toFixed(2) + ' inches';
-  } else {
+  } else if (measurement === 'miles') {} else {
     return 'wrong input';
   }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "26400.00 feets",
-   "316800.00 inches",

[Killed] ConditionalExpression
Lab/Lab Final/src/2-converter.js:10:14
   } else if (measurement === 'inches') {
     result1 = (val / 12).toFixed(2) + ' feets';
     result2 = (val / 63360).toFixed(2) + ' miles';
-  } else if (measurement === 'miles') {
+  } else if (false) {
     result1 = (val * 5280).toFixed(2) + ' feets';
     result2 = (val * 63360).toFixed(2) + ' inches';
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["26400.00 feets", "316800.00 inches"]
Received: "wrong input"

[Killed] ArithmeticOperator
Lab/Lab Final/src/2-converter.js:11:16
     result1 = (val / 12).toFixed(2) + ' feets';
     result2 = (val / 63360).toFixed(2) + ' miles';
   } else if (measurement === 'miles') {
-    result1 = (val * 5280).toFixed(2) + ' feets';
+    result1 = (val / 5280).toFixed(2) + ' feets';
     result2 = (val * 63360).toFixed(2) + ' inches';
   } else {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "26400.00 feets",
+   "0.00 feets",

[Killed] ArithmeticOperator
Lab/Lab Final/src/2-converter.js:12:16
     result2 = (val / 63360).toFixed(2) + ' miles';
   } else if (measurement === 'miles') {
     result1 = (val * 5280).toFixed(2) + ' feets';
-    result2 = (val * 63360).toFixed(2) + ' inches';
+    result2 = (val / 63360).toFixed(2) + ' inches';
   } else {
     return 'wrong input';
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "26400.00 feets",
-   "316800.00 inches",

[Killed] BlockStatement
Lab/Lab Final/src/2-converter.js:13:10
   } else if (measurement === 'miles') {
     result1 = (val * 5280).toFixed(2) + ' feets';
     result2 = (val * 63360).toFixed(2) + ' inches';
-  } else {
-    return 'wrong input';
-  }
+  } else {}
   return [result1, result2];
 }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: [undefined, undefined]

[Killed] StringLiteral
Lab/Lab Final/src/2-converter.js:14:12
     result1 = (val * 5280).toFixed(2) + ' feets';
     result2 = (val * 63360).toFixed(2) + ' inches';
   } else {
-    return 'wrong input';
+    return "";
   }
   return [result1, result2];
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: ""
