[Killed] BlockStatement
Lab/Lab Final/src/3-sorting.js:1:29
-function insertionSort(arr) {
-  let n = arr.length;
-  for (let i = 1; i < n; i++) {
-    let current = arr[i];
-    let j = i - 1;
-    while (j > -1 && current < arr[j]) {
-      arr[j + 1] = arr[j];
-      j--;
-    }
-    arr[j + 1] = current;
-  }
-  return arr;
-}
+function insertionSort(arr) {}
 
 // console.log(insertionSort([5, 1, 'yes', 1 / 0, 500, null]));
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4]
Received: undefined

[Killed] BlockStatement
Lab/Lab Final/src/3-sorting.js:3:31
 function insertionSort(arr) {
   let n = arr.length;
-  for (let i = 1; i < n; i++) {
-    let current = arr[i];
-    let j = i - 1;
-    while (j > -1 && current < arr[j]) {
-      arr[j + 1] = arr[j];
-      j--;
-    }
-    arr[j + 1] = current;
-  }
+  for (let i = 1; i < n; i++) {}
   return arr;
 }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,

[Killed] ConditionalExpression
Lab/Lab Final/src/3-sorting.js:3:19
 function insertionSort(arr) {
   let n = arr.length;
-  for (let i = 1; i < n; i++) {
+  for (let i = 1; false; i++) {
     let current = arr[i];
     let j = i - 1;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,

[Killed] LogicalOperator
Lab/Lab Final/src/3-sorting.js:6:12
   for (let i = 1; i < n; i++) {
     let current = arr[i];
     let j = i - 1;
-    while (j > -1 && current < arr[j]) {
+    while (j > -1 || current < arr[j]) {
       arr[j + 1] = arr[j];
       j--;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,

[Killed] EqualityOperator
Lab/Lab Final/src/3-sorting.js:6:12
   for (let i = 1; i < n; i++) {
     let current = arr[i];
     let j = i - 1;
-    while (j > -1 && current < arr[j]) {
+    while (j <= -1 && current < arr[j]) {
       arr[j + 1] = arr[j];
       j--;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,

[Killed] ArithmeticOperator
Lab/Lab Final/src/3-sorting.js:7:11
     let current = arr[i];
     let j = i - 1;
     while (j > -1 && current < arr[j]) {
-      arr[j + 1] = arr[j];
+      arr[j - 1] = arr[j];
       j--;
     }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,
